'''
5.7 营业税，
随意取一个商品金额，然后根据当地营业税额度计算应该缴纳营业税

5.8计算面积和体积
正方形和立方形
圆和球

5.9 数值的形式
为什么 17+32  =49 
017+32=47
017+032=41

5.10 写一对函数对华氏度 到摄氏度转换
C=(F-32)*(5-9)使用真正的除法

5.11
使用循环和算术运算，求出0-20之间的所有偶数和奇数
辨别奇数和偶数的最简单方式是什么
写函数，检测一个整数能否被另外一个整数整除；用户输入2个整数，然后 函数判断2遮是否有整除关系，返回True和False

5.12 脚本确认 python能处理的整型、浮点型和复数的范围

5.13 写一个函数把由小时和分钟表示的时间转换为只用分钟表示的时间
5.14银行利息，写函数，以定期存款利率为参数，假定账户每日计算复利，请计算并返回年华回报率
5.15 最大公约数和最小公倍数，请计算2个整型的最大公约数和最小公倍数

5.16 家庭财务
给定一个初始的金额和月开销数，使用循环，确定剩下的金额和当月的支出数，包含最后的支出数
Payment（）函数会用到初始金额和月额度，输出结果应该类似下面的格式
Enter opening balance：100.00
Enter mothly payment:16.13
Amount Remaining
Pymt#      Paid     Balance
-----      ----     ----
0           $0.00   $100
1           $16.13  $83.87
...
7           $3.22   $0.00


5.17随机数
生成一个有N个元素的由随机数n组成的列表，
其中N和n的取值范围分别为（1<N<=100) 和（0<=n<=2  31 -1)
然后再随机从列表中取 N（1<=N<=100)个随机数出来，
对他们排序，然后显示这个子集

P123

'''
